tap "homebrew/bundle"
tap "homebrew/services"
tap "jimeh/emacs-builds"
tap "matt-chapman/python2"
tap "ynqa/tap"
brew "readline", link: true
brew "asdf"
brew "autojump"
brew "bash"
brew "grpc"
brew "bear"
brew "python@3.13"
brew "clang-format"
brew "cloc"
brew "harfbuzz"
brew "rlwrap"
brew "clojure"
brew "cmake"
brew "colima"
brew "docker-completion"
brew "docker-compose"
brew "docker-credential-helper"
brew "ecl"
brew "node"
brew "emscripten"
brew "gnutls"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fsql"
brew "get_iplayer"
brew "git"
brew "glfw"
brew "gnu-getopt"
brew "jo"
brew "jq"
brew "kotlin"
brew "leiningen"
brew "libev"
brew "libffi"
brew "lua"
brew "luarocks"
brew "msgpack"
brew "nasm"
brew "neovim"
brew "nim"
brew "ocaml"
brew "opam"
brew "perl"
brew "pipx"
brew "pyenv"
brew "qemu"
brew "raylib"
brew "redis"
brew "rust"
brew "sbcl"
brew "scons"
brew "sdl12-compat"
brew "sdl2_image"
brew "sdl2_ttf"
brew "the_silver_searcher"
brew "wget"
brew "xcodegen"
brew "yt-dlp"
brew "zig"
brew "ynqa/tap/jnv"
cask "db-browser-for-sqlite"
cask "emacs-app-monthly"
cask "gstreamer-runtime"
cask "openemu"
cask "playcover-community@beta"
cask "wine-stable"
