tap "homebrew/bundle"
tap "homebrew/services"
tap "jimeh/emacs-builds"
tap "matt-chapman/python2"
brew "git"
brew "asdf"
brew "readline", link: true
brew "autojump"
brew "automake"
brew "bash"
brew "grpc"
brew "bear"
brew "clang-format"
brew "cloc"
brew "rlwrap"
brew "clojure"
brew "cmake"
brew "code-server", restart_service: :changed
brew "colima", args: ["HEAD"], restart_service: :changed
brew "coreutils"
brew "docker-completion"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "ecl"
brew "node"
brew "emscripten"
brew "gnutls"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fsql"
brew "gemini-cli"
brew "glfw"
brew "gnu-getopt"
brew "libksba"
brew "gnupg"
brew "jo"
brew "jq"
brew "kotlin"
brew "leiningen"
brew "libev"
brew "libffi"
brew "libtool"
brew "libyaml"
brew "llvm"
brew "neovim"
brew "nim"
brew "openssl@1.1"
brew "perl"
brew "pipx"
brew "pkgconf"
brew "pyenv"
brew "raylib"
brew "redis"
brew "rename"
brew "sbcl"
brew "scons"
brew "sdl12-compat"
brew "sdl2_mixer"
brew "sdl2_net"
brew "sdl3"
brew "sdl3_image"
brew "sdl3_ttf"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "xcodegen"
brew "yt-dlp"
brew "zig"
brew "zlib"
cask "emacs-app-monthly"
cask "github-copilot-for-xcode"
cask "gstreamer-runtime"
cask "ngrok"
cask "pearcleaner"
cask "playcover-community@beta"
cask "wine-stable"
cask "zed"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "qingpeng.common-lisp"
vscode "seungukshin.emacs-code"
vscode "vscodevim.vim"
